app/Controllers/Prediksi.php

    public function lihat()
    {
        $query = new PenjualanModel();

        // Alpha
        $alpha = (float) $this->request->getVar('alpha');

        if ($alpha == 0) {
            $session = session();
            $session->setFlashData('error', 'Pilih Alpha!');
            return redirect()->to(base_url('prediksi'));
        }

        // Get the dates
        $tahun = '2021';
        $bulan = 12;

        // Query
        $fetchData = $query
            ->select('*')
            ->findAll();
---
SELECT *
FROM `tb_penjualan`

    public function show_grafik()
    {
        $query = new PenjualanModel();

        // Alpha
        $alpha = (float) $this->request->getVar('alpha');

        if ($alpha == 0) {
            $session = session();
            $session->setFlashData('error', 'Pilih Alpha!');
            return redirect()->to(base_url('grafik'));
        }

        // Get the dates
        $tahun = '2021';
        $bulan = 12;

        // Query
        $fetchData = $query
            ->select('*')
            ->findAll();
---
SELECT *
FROM `tb_penjualan`